# Четное или нечетное число:
#
# Задача: Определить, является ли число четным или нечетным.

num = int(input('Введите число: '))
if num %2 == 0:
    print('число четное')
else:
    print("число не четное")